// 반복문 연습 별찍기
// *
// **
// ***
// ****
// *****

for (let i = 0; i < 5; i++) {
  console.log('*'.repeat(i + 1));
}

// *****
// ****
// ***
// **
// *

// 첫번째 경우
for (let i = 5; i >= 1; i--) {
  console.log('*'.repeat(i));
}

// 두번째 경우
for (let i = 0; i < 5; i++) {
  console.log('*'.repeat(5 - i));
}

// *
// ***
// *****
// *******
// *********

for (let i = 0; i < 9; i++) {
  if (i % 2 === 0) continue;
  console.log('*'.repeat(i));
}

// *********
// *******
// *****
// ***
// *

// 공백을 포함한 반복문 연습
//   *****
//    ****
//     ***
//      **
//       *

console.log('  '.repeat(3) + '*'.repeat(3));

//      *
//     ***
//    *****
//     ***
//      *

//      *
//     ***
//    *****
//   *******
//  *********
