// 반복문 연습 별찍기
// *
// **
// ***
// ****
// *****

for (let i = 0; i < 5; i++) {
  console.log('*'.repeat(i + 1));
}

// *****
// ****
// ***
// **
// *

// 첫번째 경우
for (let i = 5; i >= 1; i--) {
  console.log('*'.repeat(i));
}

// 두번째 경우
for (let i = 0; i < 5; i++) {
  console.log('*'.repeat(5 - i));
}

// -------------------------------------------------------

// *
// ***
// *****
// *******
// *********

for (let i = 0; i < 9; i++) {
  if (i % 2 === 0) continue;
  console.log('*'.repeat(i));
}

// *********
// *******
// *****
// ***
// *

for (let i = 9; i >= 1; i--) {
  if (i % 2 === 0) continue;
  console.log('*'.repeat(i));
}

// -------------------------------------------------------

// 공백을 포함한 반복문 연습
//   *****
//    ****
//     ***
//      **
//       *

for (let i = 5; i >= 1; i--) {
  console.log(' '.repeat(8 - i) +'*'.repeat(i));
}



// -------------------------------------------------------

//      * 
//     ***
//    *****
//   *******
//  *********

let star = ''
for (let i = 0; i < 5; i++) {
    for (let j = 4; j > i; j--) {
      star += ' '
    }
    for (let k = 0; k <= (i * 2); k++) {
        star += '*';
    }
    star += '\n';  
}
console.log(star)


// -------------------------------------------------------

//      * 
//     ***
//    *****
//   *******
//  *********
//   *******
//    *****
//     ***
//      * 

let star2 = ''
// 9번 실행 되는 반복문 설정
for (let i = 0; i < 9; i++) {
  // 5번 째 줄까지만 별이 증가 하기때문에 조건문
  if( i < 5) {
      for (let j = 4; j > i; j--) {
        star2 += ' '
      }
      for (let k = 0; k <= (i * 2); k++) {
          star2 += '*';
      }
  } else {
    for (var j = 4; j < i; j++) {
      star2 += ' ';
    }
    for (var k = 17; k > i * 2; k--) {
        star2 += '*';
        
    }
  }
  star2 += '\n'; 
}
console.log(star2)